temp1/src/InformationRegisters/кт_СведенияОHTTPПодключенииКБухгалтерии/кт_СведенияОHTTPПодключенииКБухгалтерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кт_СведенияОHTTPПодключенииКБухгалтерии</name>
  <resources>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>База</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегламентноеЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

temp1/src/Documents/Трудозатраты/Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Трудозатраты</name>
  <registerRecords>AccumulationRegister.ДоходыИсполнителей</registerRecords>
  <registerRecords>AccumulationRegister.кт_УчтенныеЗадачи</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Заказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияВБухгалтерии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияТрудозатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыЗаказчиком</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыИсполнителям</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поступление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыПоЗаказчику</name>
    <attributes>
      <name>Проекты</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВключитьВОтбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>DocumentRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФактическое</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

temp1/src/CommonModules/кт_HTTPОбменСБухгалтерией/Module.bsl
Функция ПолучитьСсылкуИзНавигационнойСсылки(Строка) Экспорт
	
	НомерСимвола = СтрНайти(Строка, "ref=") + 4; 	
	СсылкаНаРеализацию = Сред(Строка, НомерСимвола); 
	
	ПерваяСекция = Сред(СсылкаНаРеализацию,1,4);
	ВтораяСекция = Сред(СсылкаНаРеализацию,5,12);
	ТретьяСекция = Сред(СсылкаНаРеализацию,17,4);
	ЧетвертаяСекция = Сред(СсылкаНаРеализацию,21,4);
	ПятаяСекция = Сред(СсылкаНаРеализацию,25,8);  
	
	СсылкаНаРеализацию = СтрШаблон("%1-%2-%3-%4-%5",
	ПятаяСекция, ЧетвертаяСекция, ТретьяСекция, ПерваяСекция,ВтораяСекция);  
	
	Возврат СсылкаНаРеализацию;
	
КонецФункции 

Процедура ЗаполненитьОплатуВТрудозатратах(Строка) Экспорт
	
	УИД = Новый УникальныйИдентификатор(Строка.Трудозатраты);
	Трудозатраты = Документы.Трудозатраты.ПолучитьСсылку(УИД);
	
	Трудозатраты = Трудозатраты.ПолучитьОбъект();
	
	СтрокаОплата = Трудозатраты.Оплата.Добавить();
	СтрокаОплата.Номер = Строка.Номер;   
	СтрокаОплата.Дата = '00010101' + Строка.Дата;
	СтрокаОплата.Сумма = Строка.Сумма;
	СтрокаОплата.Комментарий = Строка.НазначениеПлатежа;
	СтрокаОплата.Поступление = Строка.НавигационнаяСсылка;
	
	Трудозатраты.Записать();
	
КонецПроцедуры

Функция ПолучитьJSONСтрокуТрудозатраты(Организация) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Трудозатраты.Ссылка КАК Ссылка,
	|	Трудозатраты.РеализацияВБухгалтерии КАК РеализацияВБухгалтерии
	|ИЗ
	|	Документ.Трудозатраты КАК Трудозатраты
	|ГДЕ
	|	Трудозатраты.Проведен = ИСТИНА
	|	И Трудозатраты.РеализацияВБухгалтерии <> """"
	|	И НЕ Трудозатраты.Оплата.НомерСтроки В (1)
	|	И Трудозатраты.Организация = &Организация";
	
	Запрос.Параметры.Вставить("Организация", Организация); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Массив = Новый Массив;   
	
	Пока Выборка.Следующий() Цикл    	
		Структура = Новый Структура;
		Структура.Вставить("УИД", ПолучитьСсылкуИзНавигационнойСсылки(Выборка.РеализацияВБухгалтерии));
		Структура.Вставить("Трудозатраты", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		
		Массив.Добавить(Структура);   		
	КонецЦикла; 
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Массив);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции

Процедура НачатьЗаполнениеОплатыВТрудозатратах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	кт_СведенияОHTTPПодключенииКБухгалтерии.Владелец КАК Владелец,
	|	кт_СведенияОHTTPПодключенииКБухгалтерии.Сервер КАК Сервер,
	|	кт_СведенияОHTTPПодключенииКБухгалтерии.База КАК База,
	|	кт_СведенияОHTTPПодключенииКБухгалтерии.Логин КАК Логин,
	|	кт_СведенияОHTTPПодключенииКБухгалтерии.Пароль КАК Пароль
	|ИЗ
	|	РегистрСведений.кт_СведенияОHTTPПодключенииКБухгалтерии КАК кт_СведенияОHTTPПодключенииКБухгалтерии
	|ГДЕ
	|	кт_СведенияОHTTPПодключенииКБухгалтерии.РегламентноеЗадание = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();     
	
	Пока Выборка.Следующий() Цикл    
		
		Сервер = Выборка.Сервер;
		База = Выборка.База;
		Логин = Выборка.Логин;
		Пароль = Выборка.Пароль;	
		
		АдресРесурса = СтрШаблон("/%1/hs/ObmenHD/find_all", База);     
		
		Попытка	
			Соединение = Новый HTTPСоединение(Сервер,,Логин,Пароль);	
		Исключение
			Возврат;
		КонецПопытки;
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "text/plain;charset=UTF-8");
		
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
		
		СтрокаJSON = ПолучитьJSONСтрокуТрудозатраты(Выборка.Владелец);
		
		Если СтрокаJSON = "[]" Тогда
			Продолжить;
		КонецЕсли; 
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Попытка
			Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Исключение
			Возврат;
		КонецПопытки;
		
		Если Ответ.КодСостояния <> 200 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаJSON = Ответ.ПолучитьТелоКакСтроку(); 
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		
		Массив = ПрочитатьJSON(ЧтениеJSON); 
		
		Для Каждого Строка Из Массив Цикл	
			ЗаполненитьОплатуВТрудозатратах(Строка);		
		КонецЦикла;
		
	КонецЦикла; 
		
КонецПроцедуры
